frontend/modules/wechat/controllers/AdminController.php

    public function getWechat()
    {
        if ($this->_wechat === null) {
            $wid = Yii::$app->session->get(self::SESSION_MANAGE_WECHAT_KEY);
            if (!$wid || ($wechat = Wechat::findOne($wid)) === null) {
---
SELECT * FROM `wechat` WHERE `id`=2