frontend/modules/wechat/controllers/ApiController.php

    public function init()
    {
        $this->wid = Yii::$app->request->get('wid');
        if (!$this->wid || ($this->wechat = Wechat::findOne($this->wid)) === null) {
---
SELECT * FROM `wechat` WHERE `id`='2'