frontend/modules/wechat/controllers/ReplyController.php

    protected function findModel($id)
    {
        if (($model = ReplyRule::findOne($id)) !== null) {
---
SELECT * FROM `wechat_reply_rule` WHERE `id`='20'