frontend/modules/wechat/views/fans/index.php

            'attribute' => 'groupid',
            'format' => 'html',
            'value' => function($model) {
                $fansGroups=FansGroups::findOne(['groupid' => $model->user->group_id]);
---
SELECT * FROM `wechat_fans_groups` WHERE `groupid`=0